config.el
(add-to-list 'load-path "~/.emacs.d/scripts/")

(require 'elpaca-setup)  ;; The Elpaca Package Manager
(require 'buffer-move)   ;; Buffer-move for better window management
;;(require 'app-launchers) ;; Use emacs as a run launcher like dmenu (experimental)

(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))

(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook ((python-mode . lsp-deferred)
         (c-mode . lsp-deferred)
         (c++-mode . lsp-deferred))
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (setq lsp-enable-file-watchers nil
        lsp-log-io nil
        lsp-auto-guess-root t
        lsp-keep-workspace-alive nil
        lsp-enable-snippet nil)) 

(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :after lsp-mode
  :config
  (setq lsp-ui-doc-enable t
        lsp-ui-peek-enable t
        lsp-ui-doc-position 'at-point
        lsp-ui-sideline-enable t
        lsp-ui-sideline-show-hover t
        lsp-ui-sideline-show-diagnostics t))

(use-package company-lsp
  :ensure t
  :commands company-lsp
  :config
  (push 'company-lsp company-backends))

(use-package cmake-ide
  :ensure t
  :after projectile
  :config
  (cmake-ide-setup))

(defun run-cmake ()
  "Run CMake to generate compile commands and configure the project."
  (interactive)
  (let ((project-dir (projectile-project-root))
        (build-dir "build/"))                   
    (unless (file-directory-p (concat project-dir build-dir))
      (make-directory (concat project-dir build-dir) t))
    (compile (format "cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=ON -B%s -H%s" 
                     (concat project-dir build-dir) project-dir))))

(defun find-compilers ()
  "Find available compilers on the system and let the user choose one."
  (interactive)
  (let* ((cmd (cond ((eq system-type 'windows-nt)
                     "where gcc.exe; where cl.exe") 
                    (t
                     "which gcc; which clang"))) 
         (result (shell-command-to-string cmd))
         (compilers (split-string result "\n" t)))
    (ivy-read "Select compiler: " compilers
              :action (lambda (compiler)
                        (set-compiler compiler)))))

(defun set-compiler (compiler)
  "Set the chosen compiler for CMake."
  (let ((project-dir (projectile-project-root))
        (build-dir (concat (projectile-project-root) "build/")))
    (unless (file-exists-p build-dir)
      (make-directory build-dir t))
    (compile (format "cmake -DCMAKE_C_COMPILER=%s -DCMAKE_CXX_COMPILER=%s -B%s -H%s" 
                     compiler compiler build-dir project-dir))))

(use-package dashboard
  :ensure t 
  :init
  (setq initial-buffer-choice 'dashboard-open)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
  ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
  (cond
   ((eq system-type 'windows-nt)
      (setq dashboard-startup-banner "~/.emacs.d/images/emacs-dash.png"))
   ((eq system-type 'darwin)
      (setq dashboard-startup-banner "~/.config/.emacs.d/images/emacs-dash.png"))
   ((eq system-type 'gnu/linux)
      (setq dashboard-startup-banner "~/.config/.emacs.d/images/emacs-dash.png")))

  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book")))
  :config
  (dashboard-setup-startup-hook))

(use-package diminish)

(use-package dired-open
  :config
  (setq dired-open-extensions '(("gif" . "sxiv")
                                ("jpg" . "sxiv")
                                ("png" . "sxiv")
                                ("mkv" . "mpv")
                                ("mp4" . "mpv"))))

(use-package peep-dired
  :after dired
  :hook (evil-normalize-keymaps . peep-dired-hook)
  :config
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
)

(use-package evil
    :init      ;; tweak evil's configuration before loading it
    (setq evil-want-integration t  ;; This is optional since it's already set to t by default.
          evil-want-keybinding nil
          evil-vsplit-window-right t
          evil-split-window-below t
          evil-undo-system 'undo-redo)  ;; Adds vim-like C-r redo functionality
    (evil-mode))
  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))
  (use-package evil-tutor)

(use-package flycheck
  :ensure t
  :defer t
  :diminish
  :init (global-flycheck-mode))
