config.el

(set-face-attribute 'default nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)
(set-face-attribute 'variable-pitch nil
  :font "Ubuntu"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)
;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right unless I also add this method of setting the default font.
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0.12)

(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

(use-package general
  :config
  (general-evil-setup)

  (general-create-definer dt/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC") 

  (dt/leader-keys
    "SPC" '(counsel-M-x :wk "Counsel M-x")
    "." '(find-file :wk "Find file")
    "TAB" '(comment-line :wk "Comment lines")
    "f r" '(counsel-recentf :wk "Find recent files"))

  (cond
   ((eq system-type 'windows-nt)
    (dt/leader-keys
      "f c" '(lambda () (interactive) (find-file "~/.emacs.d/config.org") :wk "Edit emacs config")))
   ((eq system-type 'darwin)
    (dt/leader-keys
      "f c" '(lambda () (interactive) (find-file "~/.config/.emacs.d/config.org") :wk "Edit emacs config")))
   ((eq system-type 'gnu/linux)
    (dt/leader-keys
      "f c" '(lambda () (interactive) (find-file "~/.config/.emacs.d/config.org") :wk "Edit emacs config"))))

  (dt/leader-keys
    "b" '(:ignore t :wk "Buffer")
    "b b" '(switch-to-buffer :wk "Switch buffer")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-this-buffer :wk "Kill this buffer")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Reload buffer"))

  (dt/leader-keys
    "c" '(:ignore t :wk "Cmake")
    "c b" '(cmake-ide-compile :wk "Build project")
    "c c" '(run-cmake :wk "Configure and generate")
    "c s" '(find-compilers :wk "Search and choose compiler"))

  (dt/leader-keys
    "d" '(:ignore t :wk "Dired")
    "d d" '(dired :wk "Open dired")
    "d j" '(dired-jump :wk "Dired jump to current")
    "d n" '(neotree-dir :wk "Open directory in neotree")
    "d p" '(peep-dired :wk "Peep-dired"))

  (dt/leader-keys
    "e" '(:ignore t :wk "Eshell/Evaluate")    
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evaluate defun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp expression")
    "e h" '(counsel-esh-history :which-key "Eshell history")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region")
    "e s" '(eshell :which-key "Eshell"))

  (dt/leader-keys
    "h" '(:ignore t :wk "Help")
    "h f" '(describe-function :wk "Describe function")
    "h t" '(load-theme :wk "Load theme")
    "h v" '(describe-variable :wk "Describe variable")
    "h r r" '(reload-init-file :wk "Reload emacs config"))

  (dt/leader-keys
    "l" '(:ignore t :wk "Lsp")
    "l f" '(:ignore t :wk "Format")
    "l f f" '(lsp-format-buffer :wk "Format buffer")
    "l f r" '(lsp-format-region :wk "Format region")
    "l s" '(:ignore t :wk "Search")
    "l s a" '(xref-find-apropos :wk "Xref find apropos")
    "l s d" '(lsp-find-declaration :wk "Find declaration")
    "l s i" '(lsp-find-implementation :wk "Find implementation")
    "l s r" '(lsp-find-references :wk "Find references")
    "l p" '(:ignore t :wk "Peek find")
    "l p d" '(lsp-ui-peek-find-definitions :wk "UI peek find definitions")
    "l p i" '(lsp-ui-peek-find-implementation :wk "UI peek find implementation")
    "l p r" '(lsp-ui-peek-find-references :wk "UI peek find references")
    "l p w" '(lsp-ui-peek-find-workspace-symbol :wk "UI peek find workspace symbol")
    "l w" '(:ignore t :wk "Workspace")
    "l w a" '(lsp-workspace-folders-add :wk "Workspace folders add")
    "l w b" '(lsp-workspace-blocklist-remove :wk "Workspace blocklist remove")
    "l w l" '(lsp-workspace-show-log :wk "Workspace show log")
    "l w o" '(lsp-workspace-folders-open :wk "Workspace folders open")
    "l w t" '(lsp-workspace-restart :wk "Workspace restart")
    "l w s" '(lsp-workspace-shortdown :wk "Workspace shutdown")
    "l w f r" '(lsp-workspace-folders-remove :wk "Workspace folders remove")
    "l w r a" '(lsp-workspace-remove-all-folders :wk "Workspace remove all folders"))

  (dt/leader-keys
    "m" '(:ignore t :wk "Org")
    "m a" '(org-agenda :wk "Org agenda")
    "m e" '(org-export-dispatch :wk "Org export dispatch")
    "m i" '(org-toggle-item :wk "Org toggle item")
    "m t" '(org-todo :wk "Org todo")
    "m B" '(org-babel-tangle :wk "Org babel tangle")
    "m T" '(org-todo-list :wk "Org todo list"))

  (dt/leader-keys
    "m b" '(:ignore t :wk "Tables")
    "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

  (dt/leader-keys
    "m d" '(:ignore t :wk "Date/deadline")
    "m d t" '(org-time-stamp :wk "Org time stamp"))

  (dt/leader-keys
    "p" '(projectile-command-map :wk "Projectile"))

  (dt/leader-keys
    "t" '(:ignore t :wk "Toggle")
    "t e" '(eshell-toggle :wk "Toggle eshell")
    "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
    "t n" '(neotree-toggle :wk "Toggle neotree file viewer")
    "t t" '(visual-line-mode :wk "Toggle truncated lines"))

  (dt/leader-keys
    "w" '(:ignore t :wk "Windows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new :wk "New window")
    "w s" '(evil-window-split :wk "Horizontal split window")
    "w v" '(evil-window-vsplit :wk "Vertical split window")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left")
    "w j" '(evil-window-down :wk "Window down")
    "w k" '(evil-window-up :wk "Window up")
    "w l" '(evil-window-right :wk "Window right")
    "w w" '(evil-window-next :wk "Goto next window")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer move left")
    "w J" '(buf-move-down :wk "Buffer move down")
    "w K" '(buf-move-up :wk "Buffer move up")
    "w L" '(buf-move-right :wk "Buffer move right"))
  )

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
